// Առաջադրանքներ՝
// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 1 : Ունենք 2 prompt`
// Առաջին prompt-ում մուտքագրվում թիվը, իսկ երկրորդում թվի աստիճանը, հաշվել մուտքագրված թվի համապատասխան աստիճանը
// Օրինակ՝ 4,2 թվերի դեպքում արդյունքը կլինի՝  4^2=16
// Հուշում՝  Խնդրի լուծման համար կարելի է օգտագործել JavaScript Math գրադարանը

// Լուծում
let a1 = prompt('Enter num: ');
let d1 = prompt('Enter degree: ');
console.log(a1 ** d1);

// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 2 : Ունենք 2 prompt`
// prompt-երում մուտքագրվում են թվեր: Առաջինում մուտքագրվում է թիվը, իսկ երկրորդում տոկոսը ։ Ցուցադրել թվի տոկոսը
// Օրինակ՝ 150 000  և  50 - ի դեպքում կցուցադրվի 150 000-ի 50 % - ը, այսինքն` 150000*50/100 = 7500։

// Լուծում
let t1 = prompt('Enter num: ');
let p1 = prompt('Enter percent: ');
console.log(t1 * p1 / 100);
// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 3 : Ունենք 3 prompt`
// prompt - երում մուտքագրվում են թվեր, ստուգել այդ թվերից ուղղանկյուն եռանկյուն կարող է կառուցվել թե ոչ
// Օրինակ՝ 3,4,5 - ի դեպքում ցույց կտրվի դրական պատասխան,քանի որ թվերը դրական են  և 3**2 +4**2=5**2, մնացյալ դեպքերում  ցույց կտրվի error։

// Լուծում
let x1 = prompt('Enter x: ');
let y1 = prompt('Enter y: ');
let z1 = prompt('Enter z: ');
(x1 > 0 && y1 > 0 && z1 > 0) ? 'valid' : console.log('error');
if((x1 > 0 && y1 > 0 && z1 > 0) && (x1**2 + y1**2 == z1**2 || y1**2 + z1**2 == x1**2 || z1**2 + x1**2 == y1**2)){
    console.log('եռանկյուն կարող է կառուցվել');
}
else{
    console.log('error');
}
// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 4 : Ունենք prompt, որտեղ մուտքագրվում է թիվ
// Ցուցադրել՝ արդյո՞ք տվյալ թիվը երկնիշ է, թե ոչ (օգտվել && օպերատորից)

// Լուծում
let k1 = prompt('Enter number: ');
if(k1 > 9 && k1 < 100){
    console.log('տվյալ թիվը երկնիշ է');
} else{
    console.log('տվյալ թիվը երկնիշ չէ');
}
// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 5 : Ունենք 3 prompt, որտեղ գրվում են թվեր
// let a = prompt('Enter first Number: ');
// let b = prompt('Enter second Number: ');
// let c = prompt('Enter thrid Number: ');
// ստուգել՝ արդյո՞ք բոլոր թվերը հավասար են իրար 

// Լուծում
if(a == b == c){
    console.log('բոլոր թվերը հավասար են իրար');
// ստուգել՝ արդյո՞ք բոլոր թվերը հավասար են 0 -ի
} else if(a == b == c == 0){
    console.log('բոլոր թվերը հավասար են 0 -ի');
// ստուգել՝ արդյո՞ք կա գոնե մեկ թիվ, որը հավասար է 0 -ի 
} else if( a == 0 || b == 0 || c == 0 ){
    console.log('կա գոնե մեկ թիվ, որը հավասար է 0 -ի');
}
// մուտքագրված երեք թվերը տպել console - ում դասավորված աճման կարգով
let min, mid, max;
// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// Լրացուցիչ առաջադրանք՝
// Ունենք prompt`
// prompt - ում մուտքագրվում է վայրկյանների քանակը, մուտքագրված վայրկյանները ձևափոխել օր/ժամ/րոպե/վայրկյան տեսքի և տպել.
// Օրինակ՝ 187801 վայրկյանի դեպքում արդյունքը կլինի՝ 2 օր, 4 ժամ, 10 րոպե, 1 վայրկյան
let sec = prompt("Enter seconds: ");
let min = sec / 60;
let hour = min / 60;
let day = Math.floor(hour / 24);
console.log(day , 'օր,', Math.floor(hour % 24), 'ժամ,', Math.floor(min % 60), 'րոպե,', Math.floor(sec % 60), 'վայրկյան');