// Առաջադրանքներ՝
// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 1 : Ունենք 2 prompt`
// Առաջին prompt-ում մուտքագրվում թիվը, իսկ երկրորդում թվի աստիճանը, հաշվել մուտքագրված թվի համապատասխան աստիճանը
// Օրինակ՝ 4,2 թվերի դեպքում արդյունքը կլինի՝  4^2=16
// Հուշում՝  Խնդրի լուծման համար կարելի է օգտագործել JavaScript Math գրադարանը

// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 2 : Ունենք 2 prompt`
// prompt-երում մուտքագրվում են թվեր: Առաջինում մուտքագրվում է թիվը, իսկ երկրորդում տոկոսը ։ Ցուցադրել թվի տոկոսը
// Օրինակ՝ 150 000  և  50 - ի դեպքում կցուցադրվի 150 000-ի 50 % - ը, այսինքն` 150000*50/100 = 7500։

// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 3 : Ունենք 3 prompt`
// prompt - երում մուտքագրվում են թվեր, ստուգել այդ թվերից ուղղանկյուն եռանկյուն կարող է կառուցվել թե ոչ
// Օրինակ՝ 3,4,5 - ի դեպքում ցույց կտրվի դրական պատասխան,քանի որ թվերը դրական են  և 3**2 +4**2=5**2, մնացյալ դեպքերում  ցույց կտրվի error։

// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 4 : Ունենք prompt, որտեղ մուտքագրվում է թիվ
// Ցուցադրել՝ արդյո՞ք տվյալ թիվը երկնիշ է, թե ոչ (օգտվել && օպերատորից)

// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 5 : Ունենք 3 prompt, որտեղ գրվում են թվեր
// let a = prompt('Enter first Number: ');
// let b = prompt('Enter second Number: ');
// let c = prompt('Enter thrid Number: ');
// ստուգել՝ արդյո՞ք բոլոր թվերը հավասար են իրար 
// ստուգել՝ արդյո՞ք բոլոր թվերը հավասար են 0 -ի
// ստուգել՝ արդյո՞ք կա գոնե մեկ թիվ, որը հավասար է 0 -ի 
// մուտքագրված երեք թվերը տպել console - ում դասավորված աճման կարգով

// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// Լրացուցիչ առաջադրանք՝
// Ունենք prompt`
// prompt - ում մուտքագրվում է վայրկյանների քանակը, մուտքագրված վայրկյանները ձևափոխել օր/ժամ/րոպե/վայրկյան տեսքի և տպել.
// Օրինակ՝ 187801 վայրկյանի դեպքում արդյունքը կլինի՝ 2 օր, 4 ժամ, 10 րոպե, 1 վայրկյան